# -*- coding: utf-8 -*-
"""
Задание 4.8

Преобразовать IP-адрес в переменной ip в двоичный формат и вывести на стандартный поток вывода вывод столбцами, таким образом:

- первой строкой должны идти десятичные значения байтов
- второй строкой двоичные значения

Вывод должен быть упорядочен также, как в примере:
- столбцами
- ширина столбца 10 символов (в двоичном формате надо добавить два пробела между столбцами)

Пример вывода для адреса 10.1.1.1:
10        1         1         1
00001010  00000001  00000001  00000001

Ограничение: Все задания надо выполнять используя только пройденные темы.

"""

ip = "192.168.3.1"
ip_add = ip.split(".")
ip_address = """
{0:<10} {1:<10} {2:<10} {3:<10}
{0:<08b}   {1:<08b}   {2:<08b}   {3:<08b}
"""
print(ip_address.format(int(ip_add[0]), int(ip_add[1]), int(ip_add[2]), int(ip_add[3])))
print(ip_address.format(192, 168, 3, 1))

